In [3]:
import pandas as pd

# question 1

In [4]:
s = pd.Series([4, 8, 15, 16, 23, 42])
s

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Question 2

In [5]:
list = [1,2,3,4,5,6,7,8,9,10]
pd.Series(list)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# question 3

In [6]:

data = {"Name" : ["Alice" , "Bob" , "Claire"] ,
        "Age" : ["25" , "30" , "27"],
        "Gender" : ["Female" , "male" , "female"] }
df = pd.DataFrame(data  )
df

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    male
2  Claire  27  female

# question 4
A pandas DataFrame is a two-dimensional data structure that can be thought of as a spreadsheet. It can also be thought of as a collection of two or more series with common indices.

Pandas Series -- One-dimensional	
Homogenous – Series elements must be of the same data type.	
Size-immutable – Once created, the size of a Series object cannot be changed.	

Pandas Dataframe-- Two-dimensional.
Heterogenous – DataFrame elements can have different data types.
Size-mutable – Elements can be dropped or added in an existing DataFrame.

Example for Dataframe-

In [7]:
data = {"Name" : ["Alice" , "Bob" , "Claire"] ,
        "Age" : ["25" , "30" , "27"],
        "Gender" : ["Female" , "male" , "female"] }
df = pd.DataFrame(data  )
df

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    male
2  Claire  27  female

example for series-

In [8]:
data = {"Name" : ["Alice" , "Bob" , "Claire"] ,
        "Age" : ["25" , "30" , "27"],
        "Gender" : ["Female" , "male" , "female"] }
dfr = pd.Series(data  )
dfr

Name        [Alice, Bob, Claire]
Age                 [25, 30, 27]
Gender    [Female, male, female]
dtype: object

# question 5
There are many data manipulating functions in pandas library like drop(), dropna() , fillna(), rename() , groupby() , apply() , applymap() etc.
eg -- for groupby() function--

In [9]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [10]:
df.groupby('Sex').agg({'PassengerId': 'count'})

        PassengerId
Sex
female          314
male            577

# question 6
Dataframe and panel both are mutable unlike Series which is immutable

# question 7

In [11]:
# Create Series by assigning names
courses = pd.Series(["Spark","PySpark","Hadoop"], name='courses')
fees = pd.Series([22000,25000,23000], name='fees')
discount  = pd.Series([1000,2300,1000],name='discount')

df=pd.concat([courses,fees,discount],axis=1)
df

   courses   fees  discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000